Backend/app/controllers/shadows_controller.rb

INSERT INTO "shadows" ("student_id", "doctor_id", "start_date", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["student_id", 45], ["doctor_id", 1], ["start_date", "2020-04-11"], ["length", "6"], ["created_at", "2020-04-16 13:54:24.403740"], ["updated_at", "2020-04-16 13:54:24.403740"]]
---
    def create
        shadow = Shadow.create(shadow_params)

SELECT "shadows".* FROM "shadows"
---
    def index
        shadows = Shadow.all

SELECT "shadows".* FROM "shadows" WHERE "shadows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shadows" WHERE "shadows"."id" = ?  [["id", 1]]
---
    def destroy
        @shadow = Shadow.find(params[:id])
        @shadow.destroy