Backend/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        students = Student.all

INSERT INTO "students" ("name", "school", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Zach4"], ["school", "onqerg"], ["created_at", "2020-04-15 22:07:29.288628"], ["updated_at", "2020-04-15 22:07:29.288628"]]
---
    def create
            student = Student.create(student_params)